package ds.rest.controller;

public class RegistrationController {

    /**
     * Минимальный набор атрибутов для стажировки: Название, описание, дата начала, дата окончания,
     * дата окончания записи, статус стажировки. Записаться на курс можно только пока доступна запись.
     * Для записи на стажировку пользователь должен предоставить следующие данные:
     * ФИО, e-mail, мобильный номер, username, telegram id, информация о себе, дата рождения,
     * город проживания, статус обучения (студент, закончил обучение, не имею профильного образования),
     * ВУЗ/СУЗ, факультет, специальность, курс.
     * Допускается множественная запись на стажировки, т.е. один человек может несколько раз записываться
     * на стажировки компании, но в конкретную стажировку только один раз. При записи необходимо проверять
     * не проходил ли данный человек стажировку ранее и если проходил, то обновлять информацию.
     */
}
